import { WrapperOffer } from '@/app/ui/OfferPage/OfferStyles';
import PageTitle from '@/app/ui/PageTitle';
import Box from '@mui/material/Box';
import Typography from '@mui/material/Typography';
import Content from '@/app/ui/Content';
import BreadCrumbs from '@/app/ui/BreadCrumbs/BreadCrumbs';
import Link from 'next/link';

const OfferPage = () => {
  return (
    <WrapperOffer>
      <Content>
        <BreadCrumbs />
        <Box sx={{ marginBottom: '32px' }}>
          <PageTitle>Договір публічної оферти</PageTitle>
          <Typography
            variant="body1"
            sx={{ margin: '16px 0', fontWeight: '700' }}
          >
            ЗАГАЛЬНІ ПОЛОЖЕННЯ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            1.1.Договір оферти, є офіційною пропозицією «Eco-bike», далі за
            текстом – «Продавець», укласти Договір купівлі-продажу товарів
            дистанційним способом, а саме через Інтернет-магазин, далі по тексту
            – «Договір», і розміщує Публічну оферту (пропозицію) на офіційному
            інтернет-сайті Продавця <Link href="/">«Eco-bike.com.ua»</Link>{' '}
            (далі – «Інтернет-сайт»).
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            1.2.Моментом повного і безумовного прийняття Покупцем пропозиції від
            Продавця (акцептом) укласти електронний договір купівлі-продажу
            товарів, вважається факт оплати Покупцем замовлення, на умовах цього
            Договору.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            У разі, якщо для оплати замовлення використовувались безготівкові
            засоби, то оплата вважається здійсненою з моменту надходження коштів
            на розрахунковий рахунок Продавця.
          </Typography>
          <Typography
            variant="body1"
            sx={{ margin: '16px 0', fontWeight: '700' }}
          >
            ПОНЯТТЯ І ВИЗНАЧЕННЯ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            2.1.Згідно цього договору, якщо не зазначене інше, наведені нижче
            терміни мають таке значення:
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            Сайт – веб-сайт, що розміщений в мережі Інтернет за адресою
            <Link href="/">Eco-bike.com.ua</Link> включаючи всі його
            веб-сторінки.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            «Товар» – моделі, аксесуари, комплектуючі та супровідні предмети, що
            були додані до кошику;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            «Інтернет-магазин» – засіб для презентації або реалізації товару
            шляхом здійснення електронної угоди.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            «Продавець» – компанія, яка реалізує товари, представлені на
            Інтернет-сайті. ФОП Волков Юрій Юрійович, місто Харків, вул. Льва
            Толстого. тел. +38 (066)-149-88-89
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            Користувач/Покупець – особа, що переглядає інформацію на Сайті
            та/або замовляє, та/або отримує, та/або резервує Товари із
            використанням технічних інструментів Сайту.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            «Замовлення» – вибір окремих позицій з переліку товарів, визначених
            Покупцем при розміщенні замовлення і здійсненні оплати.
          </Typography>
          <Typography
            variant="body1"
            sx={{ margin: '16px 0', fontWeight: '700' }}
          >
            ПРЕДМЕТ ДОГОВОРУ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            3.1.Продавець зобов'язується передати у власність Покупця Товар, що
            був обраний в Інтернет-магазині Продавця та на який Покупцем було
            самостійно оформлено замовлення на{' '}
            <Link href="/">Eco-bike.com.ua</Link> а Покупець зобов'язується
            оплатити і прийняти Товар на умовах даного Договору.
          </Typography>
          <Typography
            variant="body1"
            sx={{ margin: '16px 0', fontWeight: '700' }}
          >
            ПОРЯДОК ОФОРМЛЕННЯ ЗАМОВЛЕННЯ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            4.1.Покупець має право оформити замовлення на будь-який товар,
            представлений на сайті Інтернет-магазину і який є в наявності.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            4.2.Кожна позиція може бути представлена в замовленні в будь-якій
            кількості, за умови наявності товару у Продавця.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            4.3. При відсутності товару на складі, виявленні відмінності його
            суттєвих властивостей або ціни від заявлених на сайті
            Інтернет-магазину представник компанії зобов'язаний поставити
            Покупця до відома (телефоном або через електронну пошту). Остаточною
            ціною товару вважається ціна вказана при підтвердженні замовлення
            представником Інтернет-магазину.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            4.4.При відсутності товару, відмінності його суттєвих властивостей
            або ціни від заявлених на сайті Інтернет-магазину Покупець має право
            замінити його товаром аналогічної моделі, відмовитися від даного
            товару, анулювати замовлення.
          </Typography>
          <Typography
            variant="body1"
            sx={{ margin: '16px 0', fontWeight: '700' }}
          >
            ПОРЯДОК ОПЛАТИ ТА ДОСТАВКИ ЗАМОВЛЕННЯ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            5.1. Ціна кожного окремого Товару визначається Продавцем і
            вказується на Сайті. Ціна Замовлення визначається шляхом додавання
            ціни всіх включених в Замовлення Товарів і ціни доставки, яка
            дорівнює сумі, що підлягає до сплати, що вказується на Сайті при
            оформленні Замовлення в момент його розміщення.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            5.2. Ціна Договору дорівнює ціні Замовлення. Сума Замовлення може
            змінюватися в залежності від ціни, кількості або номенклатури
            Товару.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            5.3. Замовлення вважається сплаченим з моменту надходження оплати на
            поточний рахунок Продавця або його представника. Факт оплати
            Замовлення свідчить про згоду Користувача/Покупця з умовами цього
            Договору.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            5.4. Ціна Товару, що вказана на Сайті, може бути змінена Продавцем в
            односторонньому порядку. При цьому ціна на замовлений
            Користувачем/Покупцем Товар, яка буда підтверджена представником
            Інтернет-магазину зміні не підлягає.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            5.5. Покупець отримує замовлений товар особисто, або за допомогою
            послуги доставки
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            5.6. Способи оплати та доставки замовлення вказані в розділах
            «Оплата» та «Доставка» на сайті Інтернет-магазину.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            5.7. Разом із замовленням Покупцеві видаються документи згідно із
            законодавством України.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            5.8. У разі здійснення доставки товару за допомогою Служби доставки,
            Покупець в повному обсязі та беззаперечно погоджується з Правилами
            перевезення вантажів, що розміщені на сайті компанії-перевізника.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            5.9. При ненадходженні грошових коштів, Інтернет-магазин залишає за
            собою право анулювати замовлення.
          </Typography>
          <Typography
            variant="body1"
            sx={{ margin: '16px 0', fontWeight: '700' }}
          >
            ПРАВА ТА ОБОВ'ЯЗКИ СТОРІН:
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            6.1.Продавець має право:
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            -в односторонньому порядку припинити надання послуг за цим договором
            у разі порушення Покупцем умов цього Договору,
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            -розміщувати на Сайті інформацію про рекламні заходи та маркетингові
            активності, які проводяться чи будуть проводитись Продавцем та/або
            третіми особами-партнерами Продавця. Також, відповідно до умов цієї
            Публічної оферти та Політики конфіденційності, надсилати на адресу
            електронної пошти Користувачів електронні листи з інформацією про
            новини, рекламні заходи, маркетингові активності, інші комерційні
            пропозиції Продавця;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            -організовувати доставку Замовлень, залучаючи до надання послуг з
            доставки третіх осіб,
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            - на власний розсуд, в односторонньому порядку вносити зміни до умов
            Публічної оферти, шляхом її  розміщення (оприлюднення) в новій
            редакції на Сайті. Зміни вступають в силу з моменту їх розміщення
            (оприлюднення), якщо інший строк вступу змін в силу не визначений
            додатково при їх публікації,
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            6.2.Покупець зобов'язаний:
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            - своєчасно оплатити та отримати замовлення на умовах цього
            Договору,
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            - при реєстрації та/або при оформленні Замовлення надати Продавцю
            повну інформацію, що необхідна для здійснення доставки Замовлення.
            Користувач/Покупець несе повну відповідальність за надання
            неправдивих відомостей, що спричинили неможливість належного
            виконання Продавцем своїх зобов'язань перед Користувачем/Покупцем;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            - при одержанні Замовлення впевнитися у цілісності та комплектності
            Товару шляхом огляду вмісту Замовлення. У випадку виявлення
            пошкоджень чи неповної комплектації Товару – зафіксувати всі
            відмінності в Акті, який разом із Користувачем/Покупцем повинна
            підписати особа, яка здійснила доставку Замовлення;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            6.3.Покупець має право:
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            -оформити замовлення в Інтернет-магазині Продавця;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            -оформити електронний договір;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            -вимагати від Продавця виконання умов цього Договору.
          </Typography>
          <Typography
            variant="body1"
            sx={{ margin: '16px 0', fontWeight: '700' }}
          >
            ВІДПОВІДАЛЬНІСТЬ СТОРІН
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            7.1.Сторони несуть відповідальність за невиконання або неналежне
            виконання умов цього Договору в порядку, передбаченому цим Договором
            та чинним законодавством України
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            7.2. Продавець не несе відповідальності:
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            за зміну виробником зовнішнього вигляду Товару, комплектації та
            технічних характеристик;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            за затримку і перебої в наданні Послуг (обробки замовлення і
            доставки товару), які відбуваються з причин, що знаходяться поза
            сферою контролю Продавця;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            7.3.Сторони прикладуть максимум зусиль для вирішення будь-яких
            розбіжностей виключно шляхом переговорів 
          </Typography>
          <Typography
            variant="body1"
            sx={{ margin: '16px 0', fontWeight: '700' }}
          >
            ІНШІ УМОВИ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.1. Інтернет-магазин залишає за собою право в односторонньому
            порядку вносити зміни до цього Договору, за умови попередньої
            публікації його на сайті <Link href="/">Eco-bike.com.ua</Link>
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.2. Інтернет-магазин створений для організації дистанційного
            способу продажу товарів через Інтернет.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.3. Покупець несе відповідальність за достовірність інформації,
            зазначеної при оформленні замовлення. При здійсненні акцепту
            (оформленні замовлення і подальшої оплати товару) Покупець надає
            Продавцю свою беззастережну згоду на збір, обробку, зберігання,
            використання своїх персональних даних, згідно ЗУ «Про захист
            персональних даних».
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.4. Оплата Покупцем оформленого в Інтернет-магазині замовлення,
            означає повну згоду Покупця з умовами договору купівлі-продажу
            (публічної оферти).
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.5.Фактичною датою електронної угоди між сторонами є дата прийняття
            умов, відповідно до статті 11 Закону України «Про електронну
            комерцію».
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.6. Перегляд товарів і процес оформлення замовлення для Покупця є
            безкоштовним.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.7. Інформація, що надається Покупцем, є конфіденційною.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            Інтернет-магазин використовує інформацію про Покупця виключно в
            цілях обробки замовлення, відправлення повідомлень Покупцеві,
            доставки товару, здійснення взаєморозрахунків та інших дій,
            пов'язаних з виконанням замовлення.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.8. Продавець не несе відповідальності за якість каналів зв’язку
            загального користування та можливі перебої в мережі передачі даних
            (в тому числі, але не виключено глобальної мережі Інтернет), за
            допомогою яких здійснюється доступ до Сайту.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.9. Продавець не несе відповідальності за: незначну невідповідність
            кольорової гами Товару, що може відрізнятися від оригіналу виключно
            за різної колірної передачі моніторів персональних комп’ютерів
            окремих моделей; зміст і правдивість інформації, що надається
            Користувачем/Покупцем при оформленні замовлення; затримки та перебої
            при обробці замовлення і доставки Товару, що відбуваються з причин,
            які знаходяться поза сферою його контролю; за протиправні незаконні
            дії, здійснені Користувачем/Покупцем за допомогою даного йому
            доступу до мережі Інтернет; за передачу Користувачем/Покупцем своїх
            мережевих ідентифікаторів –ІР, МАС-адреси, логін та пароль третім
            особам.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.10. Користувач/Покупець, використовуючи наданий йому доступ до
            мережі Інтернет, самостійно несе відповідальність за шкоду,
            заподіяну його діями (особисто, навіть якщо під його логіном
            перебувала інша особа) особам або їх майну, юридичним особам,
            державі чи моральним засадам моральності.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.11. Будь-яка скарга або претензія Користувача/Покупця має бути
            оформлена в письмовій формі. Продавцем будуть прийняті усі необхідні
            заходи щодо задоволення скарги/претензії Користувача/Покупця, якщо
            така скарга/претензія буде обґрунтованою та оформленою відповідно до
            чинного законодавства України.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.12. Якщо будь-яке положення (умова), яке має місце в цьому
            Договорі або в будь-якому іншому документі, пов’язаному з ним, стає
            недійсним, незаконним, - дія та виконання положень цього документу,
            які залишились, не будуть ніяким чином порушені або послаблені, а
            таке положення (умова) буде вважатися виключеним з Договору.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8.13. Заголовки, включені до цього Договору, використовуються
            виключно для зручності та не повинні розглядатися або тлумачитися як
            такі, що мають істотний зміст при інтерпретації значення будь-якого
            положення цього Договору.
          </Typography>
          <Typography
            variant="body1"
            sx={{ margin: '16px 0', fontWeight: '700' }}
          >
            ПОРЯДОК ПОВЕРНЕННЯ ТОВАРУ НАЛЕЖНОЇ ЯКОСТІ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            9.1. Повернення товару в Інтернет-магазин відбувається згідно
            діючого законодавства України.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            9.2. Повернення товару належної якості відбувається за рахунок
            Покупця.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            9.3. При поверненні покупцем товару належної якості,
            Інтернет-магазин по факту надходження товару, що повертається,
            перераховує Покупцеві грошову суму, що була сплачена за товар з
            відрахуванням суми компенсації витрат Інтернет-магазина пов’язаних з
            доставкою товару Покупцеві.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            9.4. Покупець має право відмовитися від поставленого Товару належної
            якості протягом 14 (чотирнадцяти) днів з моменту отримання Товару
            виключно за умови, що збережено товарний вид, споживчі властивості
            Товару, упаковку, ярлики та розрахунковий документ (електронний
            документ, квитанцію, товарний чи касовий чек, квиток, талон або
            інший документ, що підтверджує факт отримання коштів, із зазначенням
            дати здійснення розрахунку).
          </Typography>
          <Typography
            variant="body1"
            sx={{ margin: '16px 0', fontWeight: '700' }}
          >
            ТЕРМІН ДІЇ ДОГОВОРУ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            10.1.Електронний договір вважається укладеним з моменту одержання
            особою, яка направила пропозицію укласти такий договір, відповіді
            про прийняття цієї пропозиції в порядку, визначеному частиною шостою
            статті 11 Закону України «Про електронну комерцію».
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            10.2.До закінчення терміну дії, цей Договір може бути розірваний за
            взаємною згодою сторін до початку процесу фактичної доставки товару,
            шляхом повернення грошових коштів.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            10.3.Сторони мають право розірвати цей Договір в односторонньому
            порядку, в разі невиконання однією із сторін умов цього Договору, та
            у випадках передбачених чинним законодавством України.
          </Typography>
          <Typography
            variant="body1"
            sx={{ margin: '16px 0', fontWeight: '700' }}
          >
            ФОРС-МАЖОРНІ ОБСТАВИНИ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            11.1. Сторона звільняється від визначеної цим Договором та (або)
            чинним в Україні законодавством відповідальності за повне чи
            часткове порушення Договору, якщо вона доведе, що таке порушення
            сталося внаслідок дії форс-мажорних обставин, за умови, що їх
            настання було засвідчено у визначеному законодавством порядку.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            11.2. Під форс-мажорними обставинами у цьому Договорі розуміють дію
            непереборних сил, що виникли незалежно від волі і бажання Сторін,
            появу яких Сторони не могли передбачити і яким не могли запобігти,
            та які включають, не обмежуючись цим, наступне: пожежі, повені,
            землетруси, зсуви, інші стихійні лиха та сезонні природні явища,
            зокрема, закриття шляхів, проток, перевалів, портів, а також війна,
            військові дії, блокади, страйки, ембарго та інші явища і дії, що
            роблять неможливим або суттєво заважають виконанню умов цього
            Договору Сторонами.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            11.3. Сторона, що має намір послатися на форс-мажорні обставини,
            зобов’язана невідкладно повідомити другу Сторону про наявність
            форс-мажорних обставин та їх вплив на виконання цього Договору.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            11.4. Якщо форс-мажорні обставини та (або) їх наслідки тимчасово
            перешкоджають виконанню цього Договору, то виконання цього Договору
            зупиняється на строк, протягом якого воно є неможливим.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            11.5. Підтвердженням наявності форс-мажорних обставин є
            довідка/сертифікат, видана(-ий) Торгово-промисловою палатою України
            або іншим належним чином уповноваженим державним органом,
            розташованим за місцем виникнення форм-мажорних обставин.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            11.6. Із припиненням дій форс-мажорних обставин Сторона, яка
            потрапила під вплив таких обставин, зобов'язана негайно інформувати
            про це в письмовому вигляді другу Сторону. У такому повідомленні
            повинен бути зазначений строк, протягом якого передбачається
            виконати зобов'язання за Договором.
          </Typography>
          <Typography
            variant="body1"
            sx={{ margin: '16px 0', fontWeight: '700' }}
          >
            РЕКВІЗИТИ ПРОДАВЦЯ:
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            ФОП Волков Юрій Юрійович
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            тел.<Link href="tel:+380661498889"> +38 066 149 88 89</Link>
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            E-mail:
            <Link href="mailto:ecobikemagazine@gmail.com">
              ecobikemagazine@gmail.com
            </Link>
          </Typography>
        </Box>
      </Content>
    </WrapperOffer>
  );
};

export default OfferPage;
