import { WrapperPrivacyPolicy } from '@/app/ui/PrivacyPolicyPage/PrivacyPolicyStyles';
import PageTitle from '@/app/ui/PageTitle';
import Box from '@mui/material/Box';
import Typography from '@mui/material/Typography';
import Content from '@/app/ui/Content';
import BreadCrumbs from '@/app/ui/BreadCrumbs/BreadCrumbs';

const PrivacyPolicyPage = () => {
  return (
    <WrapperPrivacyPolicy>
      <Content>
        <BreadCrumbs />
        <Box sx={{ marginBottom: '32px' }}>
          <PageTitle>Політика конфіденційності</PageTitle>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            Дана угода про конфіденційність розроблена відповідно до вимог
            Закону України «Про захист персональних даних» та інших нормативних
            актів українського законодавства, що регламентують правові
            відносини, пов'язані зі збором, обробкою, зберіганням персональних
            даних, а також правом громадян на невтручання в особисте життя та
            правом на самовираження.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            Інтернет-магазин eco-bike.com.ua, піклуючись про розвиток
            взаємовідносин з клієнтами, розуміючи важливість забезпечення
            охорони Ваших персональних даних, з метою вирішення можливих
            протиріч і непорозумінь підготувало цю Угоду про конфіденційність
            (політику конфіденційності), далі за текстом - «Політика
            конфіденційності», і умови користування веб-сайтом Інтернет-магазину
            https://eco-bike.com.ua, далі по тексту - «сайт». Будь ласка, уважно
            прочитайте дану сторінку, тому що інформація, викладена на ній є
            важливою для Вас як для Користувача сайту.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            1. Визначення термінів
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            1.1 У даній Політиці конфіденційності використовуються такі терміни:
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            1.1.1. «Адміністрація сайту Інтернет-магазину (далі - Адміністрація
            сайту)» - уповноважені співробітники на управління сайтом, що діють
            від імені інтернет-магазину eco-bike.com.ua, які організовують
            обробку персональних даних, а також визначає цілі обробки
            персональних даних, склад персональних даних, які підлягають
            обробці, дії або операції, що здійснюються з персональними даними.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            1.1.2. «Персональні дані» - будь-яка інформація, що відноситься
            прямо або побічно до певного або визначається фізичній особі
            (суб'єкту персональних даних).
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            1.1.3. «Обробка персональних даних» - будь-яка дія (операція) або
            сукупність дій (операцій), що здійснюються з використанням засобів
            автоматизації або без використання таких засобів з персональними
            даними, включаючи збір, запис, систематизацію, накопичення,
            зберігання, уточнення (оновлення, зміна), витяг, використання,
            передачу (поширення, надання, доступ), знеособлення, блокування,
            видалення, знищення персональних даних.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            1.1.4. «Конфіденційність персональних даних» - обов'язкова для
            дотримання Адміністратором вимога. Не допускати їх поширення без
            згоди суб'єкта персональних даних або наявності іншої законної
            підстави.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            1.1.5. «Користувач сайту Інтернет-магазину eco-bike.com.ua»- особа,
            яка має доступ до Сайту, за допомогою мережі Інтернет і використовує
            Сайт інтернет-магазину.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            1.1.6. «Cookies» - невеликий фрагмент даних, відправлений
            веб-сервером і зберігається на комп'ютері користувача, який
            веб-клієнт або веб-браузер кожен раз пересилає веб-серверу в
            HTTP-запиті при спробі відкрити сторінку відповідного сайту.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            2. Предмет ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            2.1. Користуючись сайтом або купуючи товар, пропонований на сайті, а
            також відповідаючи на необхідні питання в анкеті при реєстрації і /
            або оформленні покупки, користувач підтверджує, що дає згоду
            Інтернет-магазину eco-bike.com.ua і уповноваженим ним особам, на
            обробку персональних даних, а також що є повнолітньою особою.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            2.2. Користувач дає свою згоду Адміністрації сайту на обробку
            отриманої інформації, включаючи збір, систематизацію, накопичення,
            зберігання, уточнення (оновлення, виправлення), використання,
            поширення, знеособлення, блокування, знищення персональних даних,
            зазначених в анкеті, з метою заходів, спрямованих на формування бази
            даних учасників, складання статистичної звітності, проведення
            маркетингових досліджень, а також здійснення взаємодії з
            користувачем, в тому числі по мережах електрозв'язку, включаючи
            напрям SMS-повідомлень і електронних листів, до відкликання такої
            згоди.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            2.3. Користувач підтверджує свою згоду з тим, що Адміністрація сайту
            має право взаємодіяти з Користувачем шляхом здійснення прямих
            контактів з допомогою різних засобів зв'язку, включаючи, але не
            обмежуючись: поштова розсилка, електронна пошта, мережа Інтернет та
            ін.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            2.4. Персональні дані, дозволені до обробки в рамках цієї Політики
            конфіденційності, включають в себе, але не обмежуються наступною
            інформацією:
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 40px' }}>
            2.4.1. ПІБ Користувача;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 40px' }}>
            2.4.2. Контактний телефон Користувача;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 40px' }}>
            2.4.3. Адреса електронної пошти (e-mail);
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 40px' }}>
            2.4.4. Адреса доставки Товару;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 40px' }}>
            2.4.5. Місце проживання Користувача.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            3. Мета ЗБОРУ ТА ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            3.1. Персональну інформацію Користувача Інтернет-магазину
            eco-bike.com.ua використовує для таких цілей:
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 40px' }}>
            3.1.1. Ідентифікації Користувача, зареєстрованого на сайті
            Інтернет-магазину, для оформлення замовлення і (або) укладення
            Договору купівлі-продажу товару дистанційним способом з
            Інтернет-магазином eco-bike.com.ua.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 40px' }}>
            3.1.2. Надання Користувачеві ефективної клієнтської підтримки;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 40px' }}>
            3.1.3. Надання Користувачеві персоналізованих Сервісів;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 40px' }}>
            3.1.4. Зв'язку з Користувачем, в тому числі напрямок повідомлень,
            запитів та інформації, що стосуються використання Сервісів, надання
            послуг, а також обробки запитів і заявок від Користувача;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 40px' }}>
            3.1.5. Поліпшення якості Послуг, зручності їх використання, розробка
            нових Сервісів і послуг;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 40px' }}>
            3.1.6. Надання інформації про товари, послуги, що реалізуються
            eco-bike.com.ua, про рекламні акції, що проводяться eco-bike.com.ua,
            відповідей на запити, а також виконання eco-bike.com.ua своїх
            зобов'язань перед споживачами товарів (послуг);
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 40px' }}>
            3.1.7. Проведення статистичних та інших досліджень на основі
            знеособлених даних.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            4. КАТЕГОРІЇ зібраних даних
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            4.1. Категорії Персональних даних, збір яких здійснює сайт
            (самостійно або за посередництвом третіх осіб), включають: Файли
            «cookie» і Дані про використання мережевих ресурсів.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            4.2. Персональні дані можуть надаватися Користувачем самостійно або
            їх збір може автоматично здійснювати сайт при його використанні.
            Якщо не вказано інше, сайт https://eco-bike.com.ua використовує
            файли «cookie» (або інші засоби відстеження) для ідентифікації
            користувачів і запам'ятовування встановлених ними глобальних
            параметрів налаштування виключно в цілях надання послуги, що
            вимагаються Користувачем.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            4.3. Користувачі несуть відповідальність за Персональні дані третіх
            осіб, які вони отримують, публікують або надають іншим особам,
            використовуючи сайт, і підтверджують, що у них є згода третьої особи
            на надання Даних Власнику.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            5. СПОСОБИ І ТЕРМІНИ ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            5.1. Обробка персональних даних Користувача здійснюється без
            обмеження терміну, будь-яким законним способом, в тому числі в
            інформаційних системах персональних даних з використанням засобів
            автоматизації або без використання таких засобів.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            5.2. Користувач погоджується з тим, що Адміністрація сайту має право
            передавати персональні дані третім особам, зокрема, кур'єрським
            службам, організаціями поштового зв'язку, операторам електрозв'язку,
            виключно з метою виконання замовлення Користувача, оформленого на
            Сайті Інтернет-магазину eco-bike.com.ua, включаючи доставку Товару.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            6. ПРАВА КОРИСТУВАЧІВ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            6.1. Дізнатися, чи були збережені їх особисті дані;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            6.2. Звертатися до Адміністрації сайту, щоб дізнатися про їх зміст
            та походження;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            6.3. Перевірити їх достовірність чи попросити їх доповнити;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            6.4. Видалити, оновити або виправити свої персональні дані;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            6.5. Перетворити на формат, що забезпечує анонімність;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            6.6. Блокувати будь-які дані, що зберігаються порушуючи закон;
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            6.7. Виступити проти їх обробки з усіх без винятку законних підстав.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            7. БЕЗПЕКА персональних даних
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            7.1. Інтернет-магазин eco-bike.com.ua приймає необхідні
            організаційні та технічні заходи для захисту персональної інформації
            Користувача від неправомірного або випадкового доступу, знищення,
            перекручення, блокування, копіювання, поширення, а також від інших
            неправомірних дій третіх осіб.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            7.2. Дана Політика конфіденційності поширюється тільки на сайт
            Інтернет-магазину eco-bike.com.ua. Якщо по посиланнях, розміщеним на
            сайті останнього, Користувач зайде на ресурси третіх осіб,
            Інтернет-магазин за його дії відповідальності не несе.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            7.3. Персональні дані Користувача можуть бути використані в
            юридичних цілях в суді або на етапах, що ведуть до можливого
            звернення до суду в зв'язку з тим, що сайт або послуги
            використовувалися неналежним чином.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            Користувач обізнаний про те, що адміністрація сайту може бути
            змушена повідомити персональні дані на вимогу органів державної
            влади.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            8. ДОДАТКОВА ІНФОРМАЦІЯ ПРО персональних даних КОРИСТУВАЧА
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            8.1. Крім інформації, що міститься в цих правилах забезпечення
            конфіденційності персональних даних, сайт може надавати Користувачу
            за запитом додаткову і контекстуальну інформацію, що стосується
            конкретних послуг і сервісів або збору і обробки Персональних даних.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            8.2. З метою забезпечення роботи сайту та його технічного
            обслуговування, сайт і будь-які сторонні сервіси можуть вести файли,
            в яких реєструється взаємодія сайту з Користувачами (системні
            журнали), або використовувати з цією метою інші Персональні дані
            (зокрема, IP-адреса).
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 0' }}>
            9. ДОДАТКОВІ УМОВИ
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            9.1. Адміністрація сайту має право вносити зміни в справжню Політику
            конфіденційності без згоди Користувача.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            9.2. Нова Політика конфіденційності вступає в силу з моменту її
            розміщення на Сайті інтернет-магазину, якщо інше не передбачено
            новою редакцією Політики конфіденційності.
          </Typography>
          <Typography variant="body1" sx={{ margin: '16px 10px' }}>
            9.3. У разі незгоди з будь-якими змінами, внесеними до Правил,
            Користувач повинен припинити користуватися сайтом, а також вимагати,
            щоб Адміністрація сайту даних видалила його Персональні дані.
          </Typography>
        </Box>
      </Content>
    </WrapperPrivacyPolicy>
  );
};

export default PrivacyPolicyPage;
