export const categoryData = [
  { id: 1, name: 'Зріст', values: ['140-150', '150-160', '160-170', '170-180', '180-190', '190-200', '200-210'] },
  { id: 2, name: 'Стать', values: ['Чоловіча', 'Жіноча', 'Інша'] },
  { id: 3, name: 'Категорія велосипеда', values: ['Шосе', 'Гірський', 'Міський', 'BMX', 'Шосе', 'Електричний'] },
  { id: 4, name: 'Модельний ряд', values: ['Trek', 'Giant', 'Specialized', 'Cannondale', 'Scott', 'Cube'] },
  { id: 5, name: 'Розмір колеса', values: ['26 дюймів', '27.5 дюймів', '29 дюймів'] },
  { id: 6, name: 'Колір', values: ['Чорний', 'Червоний', 'Синій', 'Зелений', 'Білий', 'Жовтий'] },
  { id: 7, name: 'Потужність мотору', values: ['250 Вт', '500 Вт', '750 Вт', '1000 Вт'] },
  { id: 8, name: 'Об’єм акумулятора', values: ['10 Ah', '15 Ah', '20 Ah', '25 Ah'] },
  { id: 9, name: 'Вольтаж', values: ['36 В', '48 В', '52 В', '72 В'] },
  { id: 10, name: 'Додатково', values: ['Амортизація передньої вилки', 'Гідравлічні гальма', 'LED-освітлення', 'Задній багажник'] }
];


