export const categoryBlockData = [
  {
    name: "Гірські",
    img: "mtb-e-bike.jpg",
    url: "mtb-e-bike"
  },
  {
    name: "Fatbike",
    img: "fatbike.jpg",
    url: "fatbike"
  },
  {
    name: "Міські",
    img: "city-e-bike.jpg",
    url: "city-e-bike"
  },
  {
    name: "Триколісні",
    img: "e-tricycle.jpg",
    url: "e-tricycle"
  }
];

export const infoBlockData = [
  {
    title: 'Зручність',
    text: 'Не треба стояти в заторах або товпитися в маршрутці. Заряд акумуляторів можливий в домашніх умовах від звичайної електромережі.'
  },
  {
    title: 'Легкість',
    text: 'Не треба крутити педалі, велосипед все зробить за вас. Навіть фізично непідготовлена людина може подолати круті підйоми і значну відстань за рахунок електромотора.'
  },
  {
    title: 'Універсальність',
    text: 'На електро-велосипеді можна перевозити легкий вантаж, їздити на роботу або по іншим справам на відстань від 30 до 70 км залежно від ємкості АКБ.'
  },
  {
    title: 'Безшумність',
    text: 'Електромотор дуже тихий, а найголовніше це екологічно і не забруднює повітря.'
  }
]