export const categoryBlockData = [
  {
    name: 'Гірські',
    img: 'mtb-e-bike.jpg',
    url: 'mtb-e-bike',
  },
  {
    name: 'Fatbike',
    img: 'fatbike.jpg',
    url: 'fatbike',
  },
  {
    name: 'Міські',
    img: 'city-e-bike.jpg',
    url: 'city-e-bike',
  },
  {
    name: 'Триколісні',
    img: 'e-tricycle.jpg',
    url: 'e-tricycle',
  },
];

export const infoBlockData = [
  {
    title: 'Зручність',
    text: 'Не треба стояти в заторах або товпитися в маршрутці. Заряд акумуляторів можливий в домашніх умовах від звичайної електромережі.',
  },
  {
    title: 'Легкість',
    text: 'Не треба крутити педалі, велосипед все зробить за вас. Навіть фізично непідготовлена людина може подолати круті підйоми і значну відстань за рахунок електромотора.',
  },
  {
    title: 'Універсальність',
    text: 'На електро-велосипеді можна перевозити легкий вантаж, їздити на роботу або по іншим справам на відстань від 30 до 70 км залежно від ємкості АКБ.',
  },
  {
    title: 'Безшумність',
    text: 'Електромотор дуже тихий, а найголовніше це екологічно і не забруднює повітря.',
  },
];

export const catalog = [
  { id: '116094691', name: 'ЗАПЧАСТИНИ ДЛЯ ЕЛЕКТРОВЕЛОСИПЕДІВ' },
  { id: '116118803', parentId: '38', name: 'МІСЬКІ ЕЛЕКТРО-ВЕЛОСИПЕДИ' },
  { id: '117151657', parentId: '38', name: 'FAT-BIKE' },
  { id: '116763322', parentId: '39', name: 'МОТОР-КОЛЕСА' },
  { id: '116700451', name: 'ЗАПЧАСТИНИ ДЛЯ ВЕЛОСИПЕДІВ' },
  { id: '116319462', name: 'ЕЛЕКТРО-ВЕЛОКОМПЛЕКТИ' },
  {
    id: '116288305',
    parentId: '116094691',
    name: 'ЗАРЯДНІ ПРИСТРОЇ ДЛЯ ЕЛЕКТРОВЕЛОСИПЕДУ',
  },
  {
    id: '116238096',
    parentId: '38',
    name: 'ТРИКОЛІСНІ ЕЛЕКТРО-ВЕЛОСИПЕДИ',
  },
  { id: '116127700', parentId: '38', name: 'ГІРСЬКІ ЕЛЕКТРО-ВЕЛОСИПЕДИ' },
  { id: '116094628', parentId: '39', name: 'МОТОРИ' },
  { id: '116096230', name: 'АКУМУЛЯТОРИ' },
  {
    id: '125408537',
    parentId: '116700451',
    name: 'ГРІПСИ, ЗАМКИ, СИДІННЯ',
  },
  {
    id: '125353127',
    parentId: '116700451',
    name: 'ПЕРЕМИКАЧІ, МАНЕТКИ, МОНОБЛОКИ',
  },
  {
    id: '125371961',
    parentId: '116700451',
    name: 'ЛАНЦЮГИ, ШАТУНИ, ПЕДАЛІ',
  },
  { id: '125353124', parentId: '116700451', name: 'КАМЕРИ, ОБОДА, ГУМА' },
  {
    id: '125353126',
    parentId: '116700451',
    name: 'ЗІРКИ, КАССЕТИ, ВТУЛКИ',
  },
  {
    id: '124791554',
    parentId: '116700451',
    name: 'КОЛЕСА ДЛЯ ВЕЛОСИПЕДІВ',
  },
  { id: '38', name: 'ЕЛЕКТРО-ВЕЛОСИПЕДИ' },
  { id: '39', name: 'МОТОРИ ТА МОТОР-КОЛЕСА' },
  { id: '40', parentId: '116700451', name: 'КАРЕТКИ, РУБАШКИ, ТРОСИКИ' },
  { id: '41', parentId: '116700451', name: 'ПІДНІЖКИ, КРИЛА, ЛІХТАРІ' },
  { id: '42', parentId: '116094691', name: 'КОНТРОЛЕРИ' },
  { id: '43', parentId: '116094691', name: 'РУЧКИ ГАЗУ' },
  { id: '44', parentId: '116094691', name: 'ФАРИ' },
  { id: '45', parentId: '116094691', name: 'РУЧКИ ГАЗУ' },
  { id: '46', parentId: '116094691', name: 'КОМПЛЕКТИ ОБЛАДНАННЯ' },
  { id: '47', parentId: '116094691', name: 'ІНШЕ' },
];
